{"id":2644,"date":"2022-06-12T18:44:35","date_gmt":"2022-06-12T15:44:35","guid":{"rendered":"https:\/\/acure.io\/?p=2644"},"modified":"2023-02-22T17:50:37","modified_gmt":"2023-02-22T15:50:37","slug":"what-is-runbook","status":"publish","type":"post","link":"https:\/\/acure.io\/blog\/what-is-runbook\/","title":{"rendered":"What is Runbook? The Step-by-Step Guide"},"content":{"rendered":"\n<p>A runbook, which is very similar to a playbook, is a step-by-step ‘how to’ procedure detailing how to complete a specific task or process.<\/p>\n\n\n\n<p>Often used in an IT environment and part of <a href=\"https:\/\/www.fool.com\/the-blueprint\/itil-framework\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Information Technology Infrastructure Library (ITIL) framework<\/a> – a list of checklists and best practices that detail how to integrate IT operations with a company’s business objectives and procedures – a runbook demonstrates to every team member, whether they are experienced or new to the role, how a particular task or process should be conducted. <\/p>\n\n\n\n<p>For example, it could be how to implement a software update, apply a patch on a server, or even how to renew IT contracts.<\/p>\n\n\n\n<p>Runbooks are usually compiled by more experienced team members, usually at the time of carrying out the procedure, to ensure that others are able to resolve common, everyday issues or implement regular procedures without any problems. <\/p>\n\n\n\n<p>In addition, runbooks are very useful for new members of staff whereby they are able to learn about the company’s procedures and subsequently apply that knowledge without having to escalate a situation.&nbsp;<\/p>\n\n\n\n<p>It involves a set of detailed steps that are required to complete a task, as well as being used to troubleshoot a specific problem. The main purpose of a runbook is that common tasks can be carried out without the need for someone to oversee the operation. <\/p>\n\n\n\n<p>They also help in reminding people who perhaps haven’t had to deal with a particular issue for a while of the steps needed to resolve it.&nbsp;<\/p>\n\n\n\n<p>Incident response teams also use runbooks, usually in addition to their own playbooks, to help emergency response teams to deal with a situation should an IT team member not be available, thereby speeding up the resolution of an incident.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-50-1024x576.png\" alt=\"Runbook picture\" class=\"wp-image-5496\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-50-1024x576.png 1024w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-50-500x281.png 500w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-50-320x180.png 320w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-50-768x432.png 768w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-50-1536x864.png 1536w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-50-1200x675.png 1200w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-50-1568x882.png 1568w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-50.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>A runbook will typically be used for:<\/p>\n\n\n\n<ul>\n<li>System configuration and processes.<\/li>\n\n\n\n<li>Security control and access.<\/li>\n\n\n\n<li>System monitoring and alerts.<\/li>\n\n\n\n<li>Maintenance and operational tasks.<\/li>\n\n\n\n<li>Critical failure and incident recovery\/response procedures.<\/li>\n<\/ul>\n\n\n\n<p>There are<strong> 2 types of runbooks<\/strong> – specialized procedures and general procedures – depending on the task or procedure the runbook is being created for; the runbook itself can be a manual process that lays out each step, semi-automated where some tasks are automatically carried out while others are handled manually, and fully-automated.<\/p>\n\n\n\n<ul>\n<li><strong>General runbooks<\/strong> cover daily common IT tasks, such as dealing with Help Desk inquiries, how to perform a daily system backup, or documenting system performance. They help to ensure consistency and accuracy even though the task may be completed by different people.<\/li>\n\n\n\n<li><strong>Specialized runbooks<\/strong> cover more detailed, complex operations or scenarios that don’t frequently occur, such as disaster recovery responses, unscheduled downtime due to a network failure, breaches of security, and failure of IT hardware.<\/li>\n<\/ul>\n\n\n\n<p>They essentially create a manual on each and every task and\/or process within the organization. Playbooks usually incorporate runbooks but are used to manage the bigger picture. <\/p>\n\n\n\n<p>For example, should there be a security breach, a playbook will detail the recovery process, detailing which runbooks to use to get specific operations up and running again.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">How to Create a Runbook?<\/h2>\n\n\n\n<p>Before you start <a href=\"https:\/\/www.bmc.com\/blogs\/operations-runbook\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">creating a runbook<\/a>, it is important to set out a plan that lists the important elements that need to be incorporated into the runbook. <\/p>\n\n\n\n<p>For example, what is the process, why is the runbook being created, who will be the main contacts, how to report runbook activity, and is the runbook linked to other related operations.<\/p>\n\n\n\n<p>For a runbook to be effective in enabling anyone to run a specific task or procedure, it needs to cover the <strong>5 A’s<\/strong>, which are:<\/p>\n\n\n\n<ul>\n<li><strong>Actionable<\/strong> – the steps detailed in the runbook must be sequential and written in a way that anyone can understand, no matter their level of experience or expertise.<\/li>\n\n\n\n<li><strong>Accessible<\/strong> – every member of the IT team, as well as other related teams, such as incident response teams, should know where to find any runbook and have permission to access them when required.<\/li>\n\n\n\n<li><strong>Accurate<\/strong> – they must include information that is up-to-date – runbooks should be reviewed and updated with any new information or changes to the steps on a regular basis – to make sure the procedure is accurate.<\/li>\n\n\n\n<li><strong>Authoritative<\/strong> – every IT process should have its own dedicated runbook; too many runbooks relating to one operational procedure will only cause confusion.<\/li>\n\n\n\n<li><strong>Adaptable<\/strong> – any runbook should be easy to change and update. New, updated runbooks must always succeed any previous runbooks.<\/li>\n<\/ul>\n\n\n\n<p><strong>Useful links:<\/strong><\/p>\n\n\n\n<ol>\n<li><a href=\"https:\/\/learn.microsoft.com\/en-us\/azure\/automation\/manage-runbooks\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Manage runbooks in Azure<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/docs.aws.amazon.com\/systems-manager\/latest\/userguide\/automation-documents.html\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Manage runbooks in AWS<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/docs.gitlab.com\/ee\/user\/project\/clusters\/runbooks\/\" target=\"_blank\" rel=\"noreferrer noopener nofollow\">Runbook configuration with GitLab<\/a><\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">5 Main Steps to Start<\/h2>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" loading=\"lazy\" width=\"750\" height=\"400\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/08\/Runbook-Meme-Acure.io_.jpg\" alt=\"Runbook meme\" class=\"wp-image-3599\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/08\/Runbook-Meme-Acure.io_.jpg 750w, https:\/\/acure.io\/wp-content\/uploads\/2022\/08\/Runbook-Meme-Acure.io_-500x267.jpg 500w, https:\/\/acure.io\/wp-content\/uploads\/2022\/08\/Runbook-Meme-Acure.io_-320x171.jpg 320w\" sizes=\"(max-width: 750px) 100vw, 750px\" \/><figcaption class=\"wp-element-caption\">Runbook Meme<\/figcaption><\/figure>\n\n\n\n<p>There are 5 main steps to creating a runbook:<\/p>\n\n\n\n<ul>\n<li><strong>Step 1<\/strong> – plan out the runbook to include everyday processes, prioritizing those that are carried out more often or have a higher error rate than other tasks, and those that will have a greater impact on operations or the company’s financial position. Runbook templates help to ensure that all the required information is included, such as who has permission to access the runbook, any related technical documents as well as how to report and\/or escalate an issue.<\/li>\n\n\n\n<li><strong>Step 2<\/strong> – collate all the relevant information required, such as operational procedures, accessibility and permissions, hardware and software documentation, as well as how, when and to whom runbook activity is reported.<\/li>\n\n\n\n<li><strong>Step 3<\/strong> – using the information gathered, the runbook can be written. It can sometimes help to create a style guide, which includes grammar or phrases that are standardized to avoid the overuse of jargon and make the runbook easy for anyone to understand. Work with someone outside the IT team who has sufficient technical knowledge, which may help in identifying any information that is missing.<\/li>\n\n\n\n<li><strong>Step 4<\/strong> – once the draft runbook has been written, it must be tested thoroughly to ensure nothing has been left out or the procedure it is not clear and easy to follow. Make sure different groups of people test the runbook, i.e. new team members, experienced IT people, as well as those outside the IT department, such as supervisors or managers and incident response teams.<\/li>\n\n\n\n<li><strong>Step 5 <\/strong>– collate any feedback and update the runbook accordingly. Runbooks should be kept in a centralized storage location, such as in a corporate cloud, and easily accessible by the person authorized to access the runbook. This makes the runbook easy to update and a notification system can be used to advise each person of any relevant changes.<\/li>\n<\/ul>\n\n\n\n<p>It is a good idea to regularly review the runbook, particularly after any system updates have been carried out or the runbook has been used as part of an incident response situation, to make sure it is always accurate and up-to-date.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Why Do We Use Runbooks?<\/h2>\n\n\n\n<p>Runbooks are a great way to ensure that standard processes and procedures within an IT department, or any other department, are always carried out accurately and with consistency. <\/p>\n\n\n\n<p>They ensure that everyone in a team, whether they are a new team member or are experienced, can quickly get up to speed and carry out any given task, quickly and accurately. One of the main benefits of a runbook is that it avoids the need for the repetition of certain tasks or procedures. <\/p>\n\n\n\n<p>Once that task has its own runbook that sets out how to complete the operation, which can be updated with any new information and changes on a regular basis, it will ultimately save time and manpower. Runbooks can be used to set out detailed steps for simple or complex tasks and can be used by incident response teams, too.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Runbook vs. Playbook<\/h2>\n\n\n\n<p>&#8220;Runbook&#8221; and &#8220;playbook&#8221; are both terms used in the context of IT operations and management, but they refer to slightly different things.<\/p>\n\n\n\n<p><strong>A runbook<\/strong> is a document that contains a set of procedures or instructions that describe how to perform a specific task or process. It typically includes steps for troubleshooting, maintenance, or other types of activities that need to be performed regularly or in response to specific events. Runbooks are often used by IT operations teams to standardize procedures and ensure consistency in their work.<\/p>\n\n\n\n<p><strong>A playbook<\/strong>, on the other hand, is a broader term that can refer to a range of documents, tools, and resources that provide guidance for a specific task or project. Playbooks are often used in the context of incident response or disaster recovery, and they typically include a series of steps that need to be taken in order to address a specific issue or event. Playbooks can include runbooks, as well as other types of information such as contact lists, checklists, and scripts.<\/p>\n\n\n\n<p>In summary, a runbook is a specific type of document that outlines procedures for performing a task or process, while a playbook is a broader collection of resources that provides guidance for a particular task or project.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Runbook Example: Web Server Restart Runbook<\/h2>\n\n\n\n<p>Here&#8217;s an example of a runbook for a common IT task: <strong>restarting a web server.<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-49-1024x576.png\" alt=\"Runbook picture\" class=\"wp-image-5495\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-49-1024x576.png 1024w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-49-500x281.png 500w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-49-320x180.png 320w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-49-768x432.png 768w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-49-1536x864.png 1536w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-49-1200x675.png 1200w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-49-1568x882.png 1568w, https:\/\/acure.io\/wp-content\/uploads\/2023\/02\/Pics-for-Acure-Blog-49.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\">Purpose:<\/h3>\n\n\n\n<p>To provide a standard set of procedures for restarting the web server.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Scope:  <\/h3>\n\n\n\n<p>This runbook is applicable to all web servers hosted on the production environment.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Pre-Requisites:<\/h3>\n\n\n\n<p>Login credentials with sufficient privileges to access the web server.<br>Understanding of the server operating system and web server software.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Steps:<\/h3>\n\n\n\n<p><strong>1. <\/strong>Check server logs for any errors or warnings related to the web server.<br><strong>2.<\/strong> Check the status of the web server using the appropriate command (e.g., &#8220;systemctl status httpd&#8221; for Apache web server).<br><strong>3.<\/strong> Stop the web server using the appropriate command (e.g., &#8220;systemctl stop httpd&#8221; for Apache web server).<br><strong>4.<\/strong> Wait 10-15 seconds to ensure that all connections are closed.<br>Start the web server using the appropriate command (e.g., &#8220;systemctl start httpd&#8221; for Apache web server).<br><strong>5.<\/strong> Check the status of the web server using the appropriate command (e.g., &#8220;systemctl status httpd&#8221; for Apache web server).<br><strong>6. <\/strong>Verify that the web server is running by accessing a test page in a web browser.<br><strong>7.<\/strong> Check server logs for any errors or warnings related to the web server.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Post-Verification:<\/h3>\n\n\n\n<p>Ensure that the web server is functioning as expected and no errors or warnings are present in the server logs.<\/p>\n\n\n\n<p>This is just an example, actual runbooks can vary in their level of detail and complexity depending on the specific task and environment. The key goal of a runbook is to ensure that there is a standardized process for performing a task and that it is carried out consistently and efficiently.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Summing Up<\/h2>\n\n\n\n<p>A playbook is a valuable resource for any organization looking to improve its operations and increase its efficiency. By defining clear procedures and protocols, a playbook can help teams work more effectively and ensure consistency in their actions. Whether it&#8217;s for onboarding new employees, responding to customer inquiries, or managing complex projects; a playbook can provide a framework for success and help teams achieve their goals more efficiently. With the right approach and a commitment to ongoing improvement, a playbook can be a powerful tool for driving success and growth in any organization.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>A runbook, which is very similar to a playbook, is a step-by-step ‘how to’ procedure detailing how to complete a specific task or process. Often used in an IT environment and part of Information Technology Infrastructure Library (ITIL) framework – a list of checklists and best practices that detail how to integrate IT operations with&hellip; <a class=\"more-link\" href=\"https:\/\/acure.io\/blog\/what-is-runbook\/\">Continue reading <span class=\"screen-reader-text\">What is Runbook? The Step-by-Step Guide<\/span><\/a><\/p>\n","protected":false},"author":219657397,"featured_media":3611,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"content-type":""},"categories":[1402],"tags":[],"acf":{"is_featured_post":false,"head_text":"Whether it is a complex IT system, installation of software, implementation of a new procedure or understanding a sales process, having a set of detailed steps to implement or action the process ensures tasks are completed efficiently and accurately."},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What is Runbook? The Step-by-Step Guide - Acure AIOps Platform<\/title>\n<meta name=\"description\" content=\"Runbook is an IT S&amp;P process for instating, documenting, and maintaining the desired state of a customer&#039;s IT environment.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/acure.io\/blog\/what-is-runbook\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What is Runbook? The Step-by-Step Guide - Acure AIOps Platform\" \/>\n<meta property=\"og:description\" content=\"Runbook is an IT S&amp;P process for instating, documenting, and maintaining the desired state of a customer&#039;s IT environment.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/acure.io\/blog\/what-is-runbook\/\" \/>\n<meta property=\"og:site_name\" content=\"Acure AIOps Platform\" \/>\n<meta property=\"article:published_time\" content=\"2022-06-12T15:44:35+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-02-22T15:50:37+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/08\/Runbook-Acure.io_.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"450\" \/>\n\t<meta property=\"og:image:height\" content=\"227\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Pam Dawson\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Pam Dawson\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"6 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/acure.io\/blog\/what-is-runbook\/\",\"url\":\"https:\/\/acure.io\/blog\/what-is-runbook\/\",\"name\":\"What is Runbook? The Step-by-Step Guide - Acure AIOps Platform\",\"isPartOf\":{\"@id\":\"https:\/\/acure.io\/#website\"},\"datePublished\":\"2022-06-12T15:44:35+00:00\",\"dateModified\":\"2023-02-22T15:50:37+00:00\",\"author\":{\"@id\":\"https:\/\/acure.io\/#\/schema\/person\/2d20cb82be317d552d7489e51e0c32a8\"},\"description\":\"Runbook is an IT S&P process for instating, documenting, and maintaining the desired state of a customer's IT environment.\",\"breadcrumb\":{\"@id\":\"https:\/\/acure.io\/blog\/what-is-runbook\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/acure.io\/blog\/what-is-runbook\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/acure.io\/blog\/what-is-runbook\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Главная страница\",\"item\":\"https:\/\/acure.io\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"What is Runbook? The Step-by-Step Guide\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/acure.io\/#website\",\"url\":\"https:\/\/acure.io\/\",\"name\":\"Acure AIOps Platform\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/acure.io\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/acure.io\/#\/schema\/person\/2d20cb82be317d552d7489e51e0c32a8\",\"name\":\"Pam Dawson\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/acure.io\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/028e7ef4fc243ab9fd739dffd8857ed9?s=96&d=identicon&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/028e7ef4fc243ab9fd739dffd8857ed9?s=96&d=identicon&r=g\",\"caption\":\"Pam Dawson\"},\"description\":\"Tech-Journalist, Data Science Enthusiast\",\"url\":\"https:\/\/acure.io\/blog\/author\/pameladawson\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"What is Runbook? The Step-by-Step Guide - Acure AIOps Platform","description":"Runbook is an IT S&P process for instating, documenting, and maintaining the desired state of a customer's IT environment.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/acure.io\/blog\/what-is-runbook\/","og_locale":"en_GB","og_type":"article","og_title":"What is Runbook? The Step-by-Step Guide - Acure AIOps Platform","og_description":"Runbook is an IT S&P process for instating, documenting, and maintaining the desired state of a customer's IT environment.","og_url":"https:\/\/acure.io\/blog\/what-is-runbook\/","og_site_name":"Acure AIOps Platform","article_published_time":"2022-06-12T15:44:35+00:00","article_modified_time":"2023-02-22T15:50:37+00:00","og_image":[{"width":450,"height":227,"url":"https:\/\/acure.io\/wp-content\/uploads\/2022\/08\/Runbook-Acure.io_.jpg","type":"image\/jpeg"}],"author":"Pam Dawson","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Pam Dawson","Estimated reading time":"6 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/acure.io\/blog\/what-is-runbook\/","url":"https:\/\/acure.io\/blog\/what-is-runbook\/","name":"What is Runbook? The Step-by-Step Guide - Acure AIOps Platform","isPartOf":{"@id":"https:\/\/acure.io\/#website"},"datePublished":"2022-06-12T15:44:35+00:00","dateModified":"2023-02-22T15:50:37+00:00","author":{"@id":"https:\/\/acure.io\/#\/schema\/person\/2d20cb82be317d552d7489e51e0c32a8"},"description":"Runbook is an IT S&P process for instating, documenting, and maintaining the desired state of a customer's IT environment.","breadcrumb":{"@id":"https:\/\/acure.io\/blog\/what-is-runbook\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/acure.io\/blog\/what-is-runbook\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/acure.io\/blog\/what-is-runbook\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Главная страница","item":"https:\/\/acure.io\/"},{"@type":"ListItem","position":2,"name":"What is Runbook? The Step-by-Step Guide"}]},{"@type":"WebSite","@id":"https:\/\/acure.io\/#website","url":"https:\/\/acure.io\/","name":"Acure AIOps Platform","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/acure.io\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Person","@id":"https:\/\/acure.io\/#\/schema\/person\/2d20cb82be317d552d7489e51e0c32a8","name":"Pam Dawson","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/acure.io\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/028e7ef4fc243ab9fd739dffd8857ed9?s=96&d=identicon&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/028e7ef4fc243ab9fd739dffd8857ed9?s=96&d=identicon&r=g","caption":"Pam Dawson"},"description":"Tech-Journalist, Data Science Enthusiast","url":"https:\/\/acure.io\/blog\/author\/pameladawson\/"}]}},"_links":{"self":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts\/2644"}],"collection":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/users\/219657397"}],"replies":[{"embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/comments?post=2644"}],"version-history":[{"count":38,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts\/2644\/revisions"}],"predecessor-version":[{"id":5700,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts\/2644\/revisions\/5700"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/media\/3611"}],"wp:attachment":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/media?parent=2644"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/categories?post=2644"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/tags?post=2644"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}