{"id":4097,"date":"2022-10-12T11:46:07","date_gmt":"2022-10-12T08:46:07","guid":{"rendered":"https:\/\/acure.io\/?p=4097"},"modified":"2023-02-22T17:32:12","modified_gmt":"2023-02-22T15:32:12","slug":"acure-2-0","status":"publish","type":"post","link":"https:\/\/acure.io\/blog\/acure-2-0\/","title":{"rendered":"ACURE 2.0 Is Officially Released"},"content":{"rendered":"\n<p><strong>We&#8217;re excited to bring you Acure 2.0! Now we are even closer to the concept of “Monitoring as a code&#8221;, we removed synthetic triggers replacing them with a dynamic correlation approach called signals and made the interface more compact. But first things first.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">What Is Monitoring As A Code And What Does Acure Have To Do With It?<\/h2>\n\n\n\n<p>The concept of “monitoring as code” appeared on the Internet relatively recently. If we google “monitoring as code”, we will find references to this approach in many popular monitoring tools. However, if you dig deeper, it becomes clear that the described methods are just agent deployment and export setup using configuration management tools such as Puppet, Terraform or Helm. For the most part, these tools do not cover all monitoring and are limited to a simple data collection configuration.<\/p>\n\n\n\n<p>“Monitoring as code” is not just automatic installation and configuration of agents, plug-ins and exporters. It covers the entire lifecycle, including automated diagnostics, alerts, incident management and automated troubleshooting.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh5.googleusercontent.com\/zBA1Ow5L6B4Pcff1GJ0zGCsfA0K8pj1_f-jsUrPZqZ7xFBizkw4mg0aoybYmQPgkcHdDfVgwCXDnaPJqhSHkviUqdrPquCwZblAIpuAafB2TufBgtrHrDIecpeIh7de7Wq4xfkrqRI8SzqBEO_BFJ4RJyEq7IKPMIfrrNQ-I_oMTU-GuXDV6rugLVGWP\" alt=\"Meme: What if I told you in Acure monitoring is a code\"\/><figcaption class=\"wp-element-caption\">Acure 2.0 Meme<\/figcaption><\/figure>\n\n\n\n<p>From the very beginning, we at Acure have been guided by this concept. The automation scripts covered part of the monitoring cycle, but the 2.0 update is a milestone on the road to monitoring as code.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">We Have Replaced Static Triggers With Dynamic Signals 🚦<\/h2>\n\n\n\n<p>In previous version of Acure, the main tool for deduplication and correlation of primary events (alerts and logs) were synthetic triggers controlled by rules in the form of Lua scripts. Despite their flexibility, the triggers were static, which was inconvenient when managing large dynamic environments. For each event, the user had to create a separate trigger with its own rule. With a large amount of constantly changing data the number of triggers could reach hundreds of thousands! All this generated additional labor costs when setting up and further working with the system.<\/p>\n\n\n\n<p>As you already know, Acure easily syncs with other popular data monitoring systems. But static triggers gave rise to the problem of this constant synchronization &#8211; it was necessary to constantly monitor changes in synchronized systems. If a trigger was deleted or unlinked from a configuration item, the history was lost. In a dynamically changing environment, Acure would have a tough time overcoming these challenges.<\/p>\n\n\n\n<p>This is where our favorite low-code engine saved the day! Thanks to it, we were able to replace synthetic triggers with signals driven by automation scripts.<\/p>\n\n\n\n<p>Signal is similar to a task in a regular task tracker, and unlike a trigger, where only the status changes, the signal is a dynamic object. It opens on a specific event (or set of events), can attach other confirmation alerts in the process, and closes on an alert or event from the scheduler.<\/p>\n\n\n\n<p>Find out more about the Acure 2.0 automation processes in the diagram below:<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh3.googleusercontent.com\/btpsw-c92clhqwMOy1bnV9AkhIMSEfhQ0oITSxONZiKe1y6AEVBYhh0SrckROt70r7kIf4NX5sXwPNopSfELwO6Fd4q2pRzjZkNcmmjNCuNrHqa1-buuVGTsnkuVhYHh9NaaRTteV6m_wOi1zaapBW1evhQzFQZjhG81hqcqCy1iz3Ag3KkWZ3WnPvT-paAJ2f2DCg\" alt=\"Scenario architecture in Acure 2.0\"\/><figcaption class=\"wp-element-caption\"><em>Scenario architecture in Acure 2.<\/em>0<\/figcaption><\/figure>\n\n\n\n<p>As you can see from this chain, the process architecture in Acure is <strong>event-driven <\/strong>:<\/p>\n\n\n\n<p><strong>1.<\/strong> The primary event in the form of raw data enters the system through <strong>Data Streams<\/strong><em> <\/em>(push method) or with the help of <strong>Agents<\/strong><em> <\/em>(pull method).&nbsp;<\/p>\n\n\n\n<p><em><strong>Push method<\/strong><\/em><strong><em> <\/em><\/strong>involves sending data through the REST HTTP API (Data Stream API). This is how Prometheus , Ntopng , Fluentd and Nagios Core are integrated. <\/p>\n\n\n\n<p><em><strong>Pull method<\/strong><\/em><strong> <\/strong>connects and collects data from monitoring tools using Agents. An agent is a special program that can be installed on a remote device to collect data and perform some action. The Agent receives tasks from the Acure server, executes them and transfers the collected information via a secure network protocol to the server. Through the pull method, integrations with Zabbix , SCOM, Nagios XI, vCenter are implemented .<\/p>\n\n\n\n<p><strong>2.<\/strong> After entering the system the raw event is transformed to the corresponding Acure structure via <strong>ETL logs<\/strong>. We can see events and alerts in the system at this point.<\/p>\n\n\n\n<p><strong>3.<\/strong> The automation script determines what kind of event we received<em>: a monitoring event <\/em>(a breakdown of some infrastructure object or service unavailability) or <em>a topology change event <\/em>(for example, creating a new configuration item (CI) or changing its name). Each of these cases has its own scenario (or group of scenarios). <\/p>\n\n\n\n<p>In the second case, we are dealing with auto-discovery and the auto-building of the resource-service model: <strong>with the help of automation scripts, Acure enables the building of the topology of all IT services all without the use of manual labor<\/strong>. However, it is worth noting here that after the CI changes, the event correlated to this change also gets into the calculation of signals.<\/p>\n\n\n\n<p><strong>4. <\/strong>Now let&#8217;s move on to the main highlight of the recent update &#8211; <strong>signals<\/strong>. <\/p>\n\n\n\n<figure class=\"wp-block-image is-resized\"><img decoding=\"async\" loading=\"lazy\" src=\"https:\/\/lh6.googleusercontent.com\/QhbYL4Yz35cWSyLwNDOjZ4MarLjMiveKjuYQo792FNzpo5Yew-YUKEB0vEydCMb43YisKS_r_YugXvZyTEkHgTyBOnjfpifKloeTEir7lkMpbRDQrSva9Ybxp7SqqqzKIjh3t_ITULWolHglIVWVzboD19I5oCwXjFY7lgORE3yowLBDu2H0Bif7yjZM\" alt=\"Meme: Dynamic Signals vs. Static Triggers \" width=\"610\" height=\"452\"\/><figcaption class=\"wp-element-caption\">Meme: Dynamic Signals vs. Static Triggers<\/figcaption><\/figure>\n\n\n\n<p>A signal is a dynamic indicator of a change in the infrastructure with a start time and an end time. It reports the changes of any parameter from the regular state and is mainly intended for deduplication and correlation of primary events. With the help of signals, redundant copies are eliminated, and events are correlated &#8211; incidents are assigned the appropriate priority. Thus, with the help of automatic scripts, Acure not only reduces the user&#8217;s time for routine manual tasks, but also protects against information noise.&nbsp;<\/p>\n\n\n\n<p><strong>5. <\/strong>After the signal is created, the status of the configuration item is calculated.&nbsp; The CI attached to the signal takes over its criticality. For example, if a fatal level criticality is attached to some CIs, then the CIs are also painted in the corresponding bright red color. <strong>Changing the status of a CI recalculates its health and triggers the appropriate auto-actions<\/strong> (for example, team notifications, e-mails to users, or auto-repair scripts ). And all this happens <strong>automatically!<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">We Took A Course On Scenario Management 👨‍💻<\/h2>\n\n\n\n<p>Of course, there were scenarios in the case of triggers as well. Before binding (manually or via API) a trigger to the required configuration item, it was necessary to create a script for managing its statuses (manually or via a template), as well as an event prefilter. So a separate script was responsible for each individual trigger.<\/p>\n\n\n\n<p>In the case of signals in Acure 2.0, the approach to their management has completely changed. In Acure 2.0, <strong>the management of signals is entirely handled by scripts<\/strong>. By analogy with the auto-building of the resource-service model all processes related to signals are implemented inside a script written using low-code. Within the script the opening\/closing of signals takes place and the logic of their binding to configuration items is determined, as well as the attachment of events (alerts) to them. In addition, signals can be controlled by a whole set of scripts: you can create one huge alert deduplication script, which can be divided into many small ones without any restrictions.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh5.googleusercontent.com\/9LdakRSv63TIk3qkMmTFjmzOb1Ca7h9aJfL323_UztPTS0sAFF1DxNXyulqTjZZ4lX7mjlYNRha5ZO4WK4Kc6TecHA03qSO0uZZ7Nd5BKQLYltnhz0LNJaxZgBRlOlIFH8ZZWKzFgfkTIY-GzQUUyYr2aWcngmCHPprJvLqW29lM7smIpOoVPTqucMugV-KyMIyoUw\" alt=\"Part of an automation script (signal opening)\"\/><figcaption class=\"wp-element-caption\"><em>Part of an automation script (signal opening)<\/em><\/figcaption><\/figure>\n\n\n\n<p>In the same place, in the script, the configuration item is attached to the signal: directly from the script, you can access the CMDB functions, find the required CI by attributes and bind it to the signal. The binding logic can be absolutely arbitrary and depends only on the CMDB device and the log source settings.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh5.googleusercontent.com\/AkszyGBe0uv-1qYXQKE76_TIBN4PiQgEvRM_WISsvg-No68SBnxP09tUQZZSDM6J5GpQcaGYlyRKL6UcgyO-Kc9p3Vfmxx3KB-Nu9CG4aq6H1SpyUCimUJ6i931Lqrpqo7at2i9eUHPvHyGRj5syiqq51jPvy0ockgCTMufAYp3KaIX9a3WSvi9mFe1ZRShI9M1ixQ\" alt=\"Signal screen\"\/><figcaption class=\"wp-element-caption\"><em>Signal screen<\/em><\/figcaption><\/figure>\n\n\n\n<p>Let’s have a look at the concept of signals using a simple example of alert deduplication. Imagine that in case of exceeding the threshold value of the metric, the source generates an exceeding alert every 5 minutes. In Acure, a signal is opened on the first event, all subsequent confirmations are attached to this signal. When the metric returns to its original state and there are no new alerts for this metric within 30 minutes, Acure closes the signal. If the situation repeats, a new signal is generated, while the previously triggered and already closed signals remain unchanged.<\/p>\n\n\n\n<p>Such a dynamic scenario approach to problem management greatly simplifies the monitoring process, which is especially important for systems with a dynamic environment (containers, microservice architecture, Kubernetes). Simply put, <strong>instead of setting up a lot of static triggers and constantly monitoring their relevance, in the new version of Acure, it is enough to write a few scripts and forget about the old monitoring process<\/strong> &#8211; the system will do the rest, keeping with the motto “Monitoring as a code”.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">We Made &#8220;A Single Pane Of Glass&#8221; Even More Single&nbsp;🖥️<\/h2>\n\n\n\n<p>The presentation of data is just as important as the automation when comparing the effectiveness of monitoring.&nbsp; Understanding this, we revamped our approach to data visualization. Previously, an Acure user would have to repeatedly switch between several screens: the main, operational, timeline and resource-service model. The old way wasn’t significantly inconvenient but increased the time to fix the failure.&nbsp;<\/p>\n\n\n\n<p><strong>Now all the functions of the four screens are collected in a single monitoring window, where the monitoring panel is combined with the Service Model graph.<\/strong><\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh5.googleusercontent.com\/Ft5R5rjdJXdEeF00j8YQFn05TdtyVwd5_QXeD7glGhZ-YMv2FfsLlJvdBBgly6HRfT-DZK5Nn-gq4M_9AH0tHyxH3wvhBrvEERvXnVZbC1tdIV2RM6O-1jgwPtgA1vE4Yb6t3QBynqU-0Vx-ETRokf1Ow0-FtjSuEBBV0hlH09eg7X_cwEMFJSbQWUoiEFwPpoT0VA\" alt=\"Service Model Graph\"\/><figcaption class=\"wp-element-caption\"><em>Service Model Graph<\/em><\/figcaption><\/figure>\n\n\n\n<p>The single window is visually divided into two parts. In the left panel there is a list of filtered CIs, their health and status; in the right panel the information changes depending on the selected mode by the operator: Service Model graph, CI card, list of signals, service modes, Changelog. There are many different cross-links and filters on the screen.<\/p>\n\n\n\n<figure class=\"wp-block-image\"><img decoding=\"async\" src=\"https:\/\/lh3.googleusercontent.com\/Dp16wETO8HGo4Ya_pa8X2IxD30OUXuLkk0SQX9u-Eoy1rHCaMjsuIJl9QAnbSfW6DfnUCgzOarDvRoPxBVOq5sjjUa09xXhankdXfjgN91jsEUxFKH86id8JVUvG8htUbto3tquUFvO_OGyuAXp5rAqjoLlNJJX57vVWA5Bj71XjFBooBxPNZzDmPdRG47Cnj4D1nw\" alt=\"Maintenance mode\"\/><figcaption class=\"wp-element-caption\"><em>Maintenance mode<\/em><\/figcaption><\/figure>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"534\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/rsm-img-9-1024x534.png\" alt=\"Changelog\" class=\"wp-image-4150\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/rsm-img-9-1024x534.png 1024w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/rsm-img-9-500x261.png 500w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/rsm-img-9-320x167.png 320w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/rsm-img-9-768x401.png 768w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/rsm-img-9-1200x626.png 1200w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/rsm-img-9.png 1255w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><figcaption class=\"wp-element-caption\">Changelog<\/figcaption><\/figure>\n\n\n\n<p>Another feature is the functionality of transition points between maps. You can link maps to certain configuration items, after which transition points will appear on these configuration items. <strong>Making it now possible to move from one map to another directly on the Service Model graph.<\/strong><\/p>\n\n\n\n<p>This “one-stop shop” concept is designed to speed up the work with monitored objects, and thus minimize the time to solve the problem.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">💡 <strong>Find more about new Acure features in our <a href=\"https:\/\/docs.acure.io\/current\/en\" target=\"_blank\" rel=\"noreferrer noopener\">documentation<\/a> and try it by yourself in <a href=\"https:\/\/id.acure.io\/userspaces?utm_medium=article&amp;utm_source=blog\" target=\"_blank\" rel=\"noreferrer noopener\">Userspace<\/a><\/strong>.<\/h4>\n\n\n\n<h4 class=\"wp-block-heading\">💬 Discuss updates or ask any questions in our friendly community on <a href=\"https:\/\/discord.gg\/49KYAVkeG8\" target=\"_blank\" rel=\"noreferrer noopener\">Discord<\/a> or on our <a href=\"https:\/\/community.acure.io\/\" target=\"_blank\" rel=\"noreferrer noopener\">Community page<\/a>.<\/h4>\n","protected":false},"excerpt":{"rendered":"<p>We&#8217;re excited to bring you Acure 2.0! Now we are even closer to the concept of “Monitoring as a code&#8221;, we removed synthetic triggers replacing them with a dynamic correlation approach called signals and made the interface more compact. But first things first. What Is Monitoring As A Code And What Does Acure Have To&hellip; <a class=\"more-link\" href=\"https:\/\/acure.io\/blog\/acure-2-0\/\">Continue reading <span class=\"screen-reader-text\">ACURE 2.0 Is Officially Released<\/span><\/a><\/p>\n","protected":false},"author":219657405,"featured_media":4103,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"content-type":""},"categories":[1412],"tags":[],"acf":{"is_featured_post":false,"head_text":"Since the founding of Acure, we have been creating a product that not only brings profit to businesses but also makes life much easier for the end users of the platform - DevOps, data engineers, SREs, support analysts and others who monitor dozens to hundreds of IT infrastructure events, collect logs and quickly fix failures every day.\r\n\r\nFor thousands of users, Acure is already an indispensable assistant and co-pilot. The ability to collect data from disparate resources in one place in the form of topology and then show the relationships between elements significantly reduces the time to investigate incidents. Auto-discovery, auto-actions, and auto-rules allow Acure to take over part of the routine, freeing up precious time for specialists on other tasks.\r\n\r\nWe knew that was only the beginning of development. The IT infrastructures of our clients are not a few noisy servers, but consist of thousands of dynamic and mostly virtual data. This information is constantly updated and needs to be quickly and correctly correlated. Finally, request from a Latvian telecom company to modify the system to more effectively monitor dynamic environments prompted us to give Acure the power of low-code scenarios."},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>ACURE 2.0 Is Officially Released - Acure AIOps Platform<\/title>\n<meta name=\"description\" content=\"We&#039;re excited to bring you Acure 2.0! We removed synthetic triggers replacing them with a dynamic correlation approach called signals and made the interface more compact. Now we are even closer to the concept of “Monitoring as a code&#039;&#039;.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/acure.io\/blog\/acure-2-0\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"ACURE 2.0 Is Officially Released - Acure AIOps Platform\" \/>\n<meta property=\"og:description\" content=\"We&#039;re excited to bring you Acure 2.0! We removed synthetic triggers replacing them with a dynamic correlation approach called signals and made the interface more compact. Now we are even closer to the concept of “Monitoring as a code&#039;&#039;.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/acure.io\/blog\/acure-2-0\/\" \/>\n<meta property=\"og:site_name\" content=\"Acure AIOps Platform\" \/>\n<meta property=\"article:published_time\" content=\"2022-10-12T08:46:07+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-02-22T15:32:12+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-2.0-banner.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1278\" \/>\n\t<meta property=\"og:image:height\" content=\"768\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Elena Hawk\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Elena Hawk\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/acure.io\/blog\/acure-2-0\/\",\"url\":\"https:\/\/acure.io\/blog\/acure-2-0\/\",\"name\":\"ACURE 2.0 Is Officially Released - Acure AIOps Platform\",\"isPartOf\":{\"@id\":\"https:\/\/acure.io\/#website\"},\"datePublished\":\"2022-10-12T08:46:07+00:00\",\"dateModified\":\"2023-02-22T15:32:12+00:00\",\"author\":{\"@id\":\"https:\/\/acure.io\/#\/schema\/person\/43b400e67986290b8c20e271be8c1ac6\"},\"description\":\"We're excited to bring you Acure 2.0! We removed synthetic triggers replacing them with a dynamic correlation approach called signals and made the interface more compact. Now we are even closer to the concept of “Monitoring as a code''.\",\"breadcrumb\":{\"@id\":\"https:\/\/acure.io\/blog\/acure-2-0\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/acure.io\/blog\/acure-2-0\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/acure.io\/blog\/acure-2-0\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Главная страница\",\"item\":\"https:\/\/acure.io\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"ACURE 2.0 Is Officially Released\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/acure.io\/#website\",\"url\":\"https:\/\/acure.io\/\",\"name\":\"Acure AIOps Platform\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/acure.io\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/acure.io\/#\/schema\/person\/43b400e67986290b8c20e271be8c1ac6\",\"name\":\"Elena Hawk\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/acure.io\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b57eb78de6afb80a2fce19085efdc040?s=96&d=identicon&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b57eb78de6afb80a2fce19085efdc040?s=96&d=identicon&r=g\",\"caption\":\"Elena Hawk\"},\"description\":\"Content Manager at Acure\",\"url\":\"https:\/\/acure.io\/blog\/author\/kate\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"ACURE 2.0 Is Officially Released - Acure AIOps Platform","description":"We're excited to bring you Acure 2.0! We removed synthetic triggers replacing them with a dynamic correlation approach called signals and made the interface more compact. Now we are even closer to the concept of “Monitoring as a code''.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/acure.io\/blog\/acure-2-0\/","og_locale":"en_GB","og_type":"article","og_title":"ACURE 2.0 Is Officially Released - Acure AIOps Platform","og_description":"We're excited to bring you Acure 2.0! We removed synthetic triggers replacing them with a dynamic correlation approach called signals and made the interface more compact. Now we are even closer to the concept of “Monitoring as a code''.","og_url":"https:\/\/acure.io\/blog\/acure-2-0\/","og_site_name":"Acure AIOps Platform","article_published_time":"2022-10-12T08:46:07+00:00","article_modified_time":"2023-02-22T15:32:12+00:00","og_image":[{"width":1278,"height":768,"url":"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-2.0-banner.png","type":"image\/png"}],"author":"Elena Hawk","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Elena Hawk","Estimated reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/acure.io\/blog\/acure-2-0\/","url":"https:\/\/acure.io\/blog\/acure-2-0\/","name":"ACURE 2.0 Is Officially Released - Acure AIOps Platform","isPartOf":{"@id":"https:\/\/acure.io\/#website"},"datePublished":"2022-10-12T08:46:07+00:00","dateModified":"2023-02-22T15:32:12+00:00","author":{"@id":"https:\/\/acure.io\/#\/schema\/person\/43b400e67986290b8c20e271be8c1ac6"},"description":"We're excited to bring you Acure 2.0! We removed synthetic triggers replacing them with a dynamic correlation approach called signals and made the interface more compact. Now we are even closer to the concept of “Monitoring as a code''.","breadcrumb":{"@id":"https:\/\/acure.io\/blog\/acure-2-0\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/acure.io\/blog\/acure-2-0\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/acure.io\/blog\/acure-2-0\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Главная страница","item":"https:\/\/acure.io\/"},{"@type":"ListItem","position":2,"name":"ACURE 2.0 Is Officially Released"}]},{"@type":"WebSite","@id":"https:\/\/acure.io\/#website","url":"https:\/\/acure.io\/","name":"Acure AIOps Platform","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/acure.io\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Person","@id":"https:\/\/acure.io\/#\/schema\/person\/43b400e67986290b8c20e271be8c1ac6","name":"Elena Hawk","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/acure.io\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b57eb78de6afb80a2fce19085efdc040?s=96&d=identicon&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b57eb78de6afb80a2fce19085efdc040?s=96&d=identicon&r=g","caption":"Elena Hawk"},"description":"Content Manager at Acure","url":"https:\/\/acure.io\/blog\/author\/kate\/"}]}},"_links":{"self":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts\/4097"}],"collection":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/users\/219657405"}],"replies":[{"embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/comments?post=4097"}],"version-history":[{"count":17,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts\/4097\/revisions"}],"predecessor-version":[{"id":5683,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts\/4097\/revisions\/5683"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/media\/4103"}],"wp:attachment":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/media?parent=4097"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/categories?post=4097"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/tags?post=4097"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}