{"id":4424,"date":"2022-10-28T16:42:40","date_gmt":"2022-10-28T13:42:40","guid":{"rendered":"https:\/\/acure.io\/?p=4424"},"modified":"2023-04-09T17:05:47","modified_gmt":"2023-04-09T14:05:47","slug":"autonomous-it-talks-savinder-puri","status":"publish","type":"post","link":"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/","title":{"rendered":"How DevOps and Other IT Pros Survive Transformational Shift"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">About DevOps dimensions<\/h2>\n\n\n\n<p>&#8220;It is famously said that every company is a software company. And I would like to extend by saying that today in 2022, every company is a DevOps company. Especially in the post-pandemic world, that has become the norm. DevOps is no longer a word you just hear in conferences. It has become a glaring business&nbsp;requirement today.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-cover-1024x576.png\" alt=\"Savider Puri\" class=\"wp-image-4448\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-cover-1024x576.png 1024w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-cover-500x281.png 500w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-cover-320x180.png 320w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-cover-768x432.png 768w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-cover-1536x864.png 1536w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-cover-1200x675.png 1200w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-cover-1568x882.png 1568w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-cover.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>There are a couple of dimensions in DevOps that make it increasingly important. First is <strong>the business impact<\/strong> &#8211; the direct impact on the top line that an organization can check with metrics. <\/p>\n\n\n\n<p>Then, there’s the <strong>bottom-line impact<\/strong>, with things like developer productivity, defect density, and cost of quality. So that&#8217;s the business angle to it. The organizational angle is that all organizations are now moving, or maturing towards agile, guilds, chapter, tribe &#8211; whatever you call it. They&#8217;re either creating centralized structures, or they&#8217;re getting into the decentralized Center of Excellence (CoE) kind of teams, looking at creating Platform teams that need a DevOps approach. <\/p>\n\n\n\n<p>Then <strong>the ways of working are changing<\/strong>. That&#8217;s the third dimension to it. The <strong>feature driven development<\/strong>, talks about continuous security, and <strong>canary deployments<\/strong> &#8211; all that needs DevOps. <\/p>\n\n\n\n<p>And then finally, <strong>new technologies coming <\/strong>in like chaos engineering, AB testing, Metaverse, etc. There&#8217;s a lot of talk about carbon emissions in software industry too. In fact, I&#8217;m one of the mentors at DevOps Summit, Canada, where this is a new track that we are picking up &#8211; how do you reduce carbon emissions in the software development lifecycle, and that&#8217;s where again, DevOps has a role. So DevOps has become very important in any dimension that you look at, in the entire software delivery lifecycle&#8221;.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">About Different DevOps Transformation<\/h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-transformation-1024x576.png\" alt=\"DevOps transformation picture\" class=\"wp-image-4457\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-transformation-1024x576.png 1024w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-transformation-500x281.png 500w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-transformation-320x180.png 320w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-transformation-768x432.png 768w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-transformation-1536x864.png 1536w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-transformation-1200x675.png 1200w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-transformation-1568x882.png 1568w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-transformation.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>&#8220;Fundamentally, the focus of DevOps is different for small and medium enterprises than the&nbsp;largeer enterprises. And that’s because&nbsp; business requirements are different. And there are two-three angles to this. <\/p>\n\n\n\n<p>One is the <strong>operations angle<\/strong>. Typically, a small enterprise is focused on stabilizing and scaling up operations without impacting user experience. I was reading an article, and there was a cricket match between India and Pakistan over the weekend. That&#8217;s the Asia Cup final. One of the popular channels Disney Hotstar was telecasting it to 13 million concurrent users. Now, imagine the amount of infrastructure you need to be able to support! And this is across mobile devices. The majority of them were watching it on cell phones, on the go at 3g, 4g, 5g speeds. So imagine the kind of infrastructure it will take to support something like that. Yes, that&#8217;s at the small and the medium businesses.&nbsp;<\/p>\n\n\n\n<p>Then you come to the banks, the large retailers, where they have a different problem. There, you have <strong>a wealth of technology<\/strong>. You know, everything from the Java, .NET, multiple ERPs, Oracle, Salesforce, Mainframe, Heritage Systems, and you have to support all of that. It&#8217;s a fundamental difference in their structure. There&#8217;s a big people dimension as well. People want to work in an organization which supports 13 million concurrent users, which is telecasting the next big sporting event. People probably don&#8217;t want to work in a bank, which has been around for 100 years, and&nbsp;is not transforming. It&#8217;s about attracting the right talent also. So <strong>we have different organizations, different dimensions to the challenge, both from a technology and a people perspective&#8221;.<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">About DevOps Career Path&nbsp;<\/h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-career-path-picture-1024x576.png\" alt=\"\" class=\"wp-image-4462\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-career-path-picture-1024x576.png 1024w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-career-path-picture-500x281.png 500w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-career-path-picture-320x180.png 320w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-career-path-picture-768x432.png 768w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-career-path-picture-1536x864.png 1536w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-career-path-picture-1200x675.png 1200w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-career-path-picture-1568x882.png 1568w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/DevOps-career-path-picture.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>&#8220;A typical DevOps engineer profile could be different for different organizations because this is still not very well established. This is how a typical DevOps engineer&#8217;s career will move and this is how I&#8217;ve seen it evolve in the last 10-15 years.&nbsp;<\/p>\n\n\n\n<p>You start with a <strong>DevOps engineer<\/strong>, basically maintaining a DevOps pipeline, you&#8217;re fixing build breaks, you&#8217;re doing continuous automation, you&#8217;re putting the fundamentals in place, you&#8217;re gaining the depth of skill, because you&#8217;re in one team on one technology stack, and you&#8217;re going deep. That&#8217;s a typical DevOps engineers’ profile.<\/p>\n\n\n\n<p>A couple of years later, you move to a <strong>senior DevOps engineer<\/strong>, where you&#8217;re graduating from maintaining somebody else&#8217;s pipeline to creating a pipeline and onboarding new projects into the DevOps pipeline. You&#8217;re continuously automating on the environment side, on the app side. Now, you&#8217;ve gone from one team to multiple teams. You gain a width of skills, and then you start cementing the fundamentals that you&#8217;ve probably learned in the first couple of years.&nbsp;<\/p>\n\n\n\n<p>Then you grow on to a <strong>DevOps architect<\/strong>, where you work across multiple technology stacks, hopefully, across an enterprise.&nbsp;You can set up a DevOps capability. You’re&nbsp;training the development teams. Here you have width and depth of technology. It’s very important at this stage to start developing people skills in parallel because as you move further on from a DevOps architect, you will have a lot more people interaction.&nbsp;&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-Devops-Career-1024x576.png\" alt=\"DevOps career path from video\" class=\"wp-image-4435\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-Devops-Career-1024x576.png 1024w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-Devops-Career-500x281.png 500w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-Devops-Career-320x180.png 320w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-Devops-Career-768x432.png 768w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-Devops-Career-1536x864.png 1536w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-Devops-Career-1200x675.png 1200w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-Devops-Career-1568x882.png 1568w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-Devops-Career.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>Now, there&#8217;s a fork in the road. What does that mean? You can go in a technology direction, <strong>the principal architect<\/strong>, who typically pushes for DevOps at a large enterprise. You are at the bleeding edge of new technology, stacks, new tools, you work across cross-functional teams, and you&#8217;re trying to break the silo between the Dev and the Ops, but you&#8217;re basically a <strong>DevOps architect with a very strong technology vision.&nbsp;<\/strong><\/p>\n\n\n\n<p>The other alternative to this is more technology focused very deep technical work. The other side to that is <strong>consulting<\/strong>, where you go more on the web part of it, you probably work in an SI or a consulting company. You work across Enterprises, drive business value, and you may be set up DevOps capability for large enterprises. You talk about organizational change management, <strong>this is an architect with a business vision.&nbsp;<\/strong>Now, you can&#8217;t directly become <strong>a DevOps consultant<\/strong>, if you&#8217;ve not done the pipelines and everything in between by yourself.<strong>&nbsp;<\/strong><\/p>\n\n\n\n<p>And then you evolve into a <strong>DevOps evangelist<\/strong>. Evangelists are typically one who has worked across multiple enterprises who have done various shapes and forms of organizational change management, and who&#8217;s created new roles and responsibilities in the organization. We spoke about probably setting up an SRE function, a release management function and those kinds of things. And this is who has enterprise structure for multispeed IT where some parts of the organization are moving extremely fast. They are into microservices, cloud native, and the other side of the organization. So that&#8217;s the typical career path of a DevOps engineer&#8221;.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">About The Future Of System Administrators<\/h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Sysadmin-picture-1024x576.png\" alt=\"The Future of SysAdmins picture\n\" class=\"wp-image-4463\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Sysadmin-picture-1024x576.png 1024w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Sysadmin-picture-500x281.png 500w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Sysadmin-picture-320x180.png 320w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Sysadmin-picture-768x432.png 768w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Sysadmin-picture-1536x864.png 1536w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Sysadmin-picture-1200x675.png 1200w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Sysadmin-picture-1568x882.png 1568w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Sysadmin-picture.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>&#8220;Today’s typical Enterprises are all moving towards using some parts&nbsp; of the Cloud, probably they will even go serverless in some portions, and move their data into the cloud over the next four or five years. Now let&#8217;s look at what happens to system admins, as this change happens. Their bread and butter &#8211;&nbsp; supporting Environments, IIS, WebLogic,&nbsp;WebSphere, etc. will disappear in the next five years. Most technologies will not be relevant because the way you deploy a cloud native application and application over a container is completely different than this. It may be around <strong>20-30% of the infrastructure will still be heritage<\/strong>. Maybe some in a bank or in the retailers.&nbsp;<\/p>\n\n\n\n<p>They&#8217;re also the way they are creating environments. Today, maybe it&nbsp;takes a week or ten days to create environments. We&#8217;re talking about immutable environments, creating environments in matter of hours, if not minutes, the way they do patching, the way they do release management.&nbsp;<\/p>\n\n\n\n<p>If you look at the latest <strong>Upskilling industry report from DevOps Institute<\/strong>, that covered about 120 odd countries, they also say that <strong>40% of the people said that resource and skill shortage is one of the top three challenges<\/strong>. And technical debt must be paired with talent debt. So the opportunity is out there for the system admins to evolve themselves into the new roles. The business requirement is there, the opportunity is there. Now it is upon the individuals, whether they want to <strong>jump on that bandwagon and move into the new workload of 60-70%<\/strong>. Or they want to <strong>stay at the guard of<\/strong> <strong>20-30%<\/strong>, which will continue for a couple of years further. But then life is tough.<\/p>\n\n\n\n<p>I don&#8217;t want to create a very bleak picture out there. But as you can understand large transformation programs like this don&#8217;t happen in one or two years. They take time depends on your organization and what phase of the transformation program it is in. But one thing very clear the wave is coming, and <strong>it will fundamentally change the way we have worked in the last 15-20 years<\/strong>. But there is no need to panic. As long as you recognize that the world out there is changing you have time to make the right moves, learn the right things, pick up the new roles&#8221;.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">About SRE as a Option for Career<\/h2>\n\n\n\n<p>&#8220;Things like SRE were carved out primarily by the likes of Google. They operate in a very different space, they had a different set of challenges. And they came out with the concept of SRE, which works great in their context. Just renaming your support team on a random Monday morning and calling it an SRE team won&#8217;t really work. It&#8217;s a good career pivot, if your organization has people who can think through the&nbsp;journey, and tailor what SRE needs for your enterprise. Because your enterprise is not&nbsp;Google, and it doesn&#8217;t have the same challenges. So, if that is done it&#8217;s a good logical extension for people in the traditional app area assuming, that they are willing to pick up some new skills and change the way in which they have been working&#8221;.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">About Other IT Roles and Steps for People Looking for Guidance<\/h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"1024\" height=\"576\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Other-IT-roles-picture-1024x576.png\" alt=\"Other IT roles picture\" class=\"wp-image-4464\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Other-IT-roles-picture-1024x576.png 1024w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Other-IT-roles-picture-500x281.png 500w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Other-IT-roles-picture-320x180.png 320w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Other-IT-roles-picture-768x432.png 768w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Other-IT-roles-picture-1536x864.png 1536w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Other-IT-roles-picture-1200x675.png 1200w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Other-IT-roles-picture-1568x882.png 1568w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Other-IT-roles-picture.png 1920w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/figure>\n\n\n\n<p>&#8220;If you&#8217;re working in a large enterprise in things like <strong>ITIL<\/strong>, for example, or any other shape and form of, if you&#8217;ve led a lean initiative, then the new versions of ITIL like ITIL V4 could be easy to pick on.&nbsp;<\/p>\n\n\n\n<p>If you pick up <strong>infrastructure automation<\/strong>, good opportunity will be to go into infrastructure as cloud, looking at things like <strong>Chef, Puppet Ansible, TerraForm<\/strong>. And you can very heavily relate that to the way you used to create environments in the past. All you need to figure out is your area environment. How does that map to container? What&#8217;s the difference? And how do you map your traditional world of a virtual environment and virtual systems and how does that relate to containers? If you can make that shift that&#8217;s another good area to get into.&nbsp;<\/p>\n\n\n\n<p>Then there is the <strong>DevOps engineer area<\/strong>. If you&#8217;re excited about creating software builds, shipping out stuff faster to customers, that&#8217;s potentially another area you can look at.&nbsp;<\/p>\n\n\n\n<p>One of my mentors told me several years back: always pray true to your core skill. If core skill is system admin stay true to it, you just have to see how it maps in the new world. If your true skill is an infrastructure engineer stay true to that, because you spend ten or twenty years doing that. So don&#8217;t just jump and you know, start learning Kubernetes; it&#8217;s great, but probably is not relevant to us. <strong>Stay true to your core skill, figure out what&#8217;s the extension of your core skill in the new environment and then the gap how to bridge that. <\/strong>That is my three step algorithm for people who are looking for guidance&#8221;.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">About Knowledge, Skills and Mastery<\/h2>\n\n\n\n<figure class=\"wp-block-image size-large\"><img decoding=\"async\" loading=\"lazy\" width=\"880\" height=\"1024\" src=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-DevOps-map-1-880x1024.png\" alt=\"DevOps Roadmap\" class=\"wp-image-4489\" srcset=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-DevOps-map-1-880x1024.png 880w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-DevOps-map-1-430x500.png 430w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-DevOps-map-1-275x320.png 275w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-DevOps-map-1-768x894.png 768w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-DevOps-map-1-1320x1536.png 1320w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-DevOps-map-1-1200x1397.png 1200w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-DevOps-map-1-1568x1825.png 1568w, https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Acure-DevOps-map-1.png 1758w\" sizes=\"(max-width: 880px) 100vw, 880px\" \/><figcaption class=\"wp-element-caption\">DevOps Roadmap<\/figcaption><\/figure>\n\n\n\n<p>&#8220;You should always remember about the difference between <strong>knowledge, skill and mastery<\/strong>. What do I mean by that? You can at best master one or two areas in your entire life. Where you can be really, really, really good at it, you are the guru in that it&#8217;s just one or two areas.&nbsp;So that&#8217;s <strong>mastery<\/strong>. You can obviously have a number of <strong>skills<\/strong>.&nbsp;And you should have <strong>a knowledge<\/strong> of everything under the sun today. But the key is knowing what to master, what to get skilled on, and what to have knowledge of.&nbsp;<\/p>\n\n\n\n<p>If you go to a conference, and they say serverless is the next big thing since sliced bread, you don&#8217;t go after the mastery of serverless. First, you want the knowledge of serverless. What is it? How is it relevant? Does it relate to what you’re doing or not? <\/p>\n\n\n\n<p><strong>The very simple guideline for that is just type the new technology named serverless on Google, if you can answer the first page, and if you can understand what&#8217;s written on the first page, that&#8217;s good enough knowledge to get by simple rule.<\/strong><\/p>\n\n\n\n<p>If that is something that relates to you, it&#8217;s interesting for you try and develop a skill around that. Go to Udemy, one of those online courses, pick up a course or two, probably use YouTube. Try a small proof of concept. It&#8217;s not about doing one course or two. It&#8217;s about building applications. Get a cloud account, download the tools, try something, build something. And then you will realize if you like it or not. And then go deeper. But stay with these three things: knowledge, skill, and mastery. Figure out which one to apply and where&#8221;.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\">📺 <strong>Watch the full conversation on our channel. <\/strong><\/h4>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Autonomous IT Talks w\/ Savinder Puri, DevOps Evangelist at TBC\" width=\"750\" height=\"422\" src=\"https:\/\/www.youtube.com\/embed\/WIC9iCynl-Q?start=19&#038;feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe>\n<\/div><\/figure>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>And don&#8217;t forget to subscribe so you don&#8217;t miss the next Autonomous IT Talks<\/strong>. <\/h4>\n","protected":false},"excerpt":{"rendered":"<p>About DevOps dimensions &#8220;It is famously said that every company is a software company. And I would like to extend by saying that today in 2022, every company is a DevOps company. Especially in the post-pandemic world, that has become the norm. DevOps is no longer a word you just hear in conferences. It has&hellip; <a class=\"more-link\" href=\"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/\">Continue reading <span class=\"screen-reader-text\">How DevOps and Other IT Pros Survive Transformational Shift<\/span><\/a><\/p>\n","protected":false},"author":219657405,"featured_media":4495,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"content-type":""},"categories":[1404,1415],"tags":[],"acf":{"is_featured_post":false,"head_text":"<!-- wp:paragraph -->\r\n\r\nIT does not stand still. Along with technology, the related professions are also changing. In recent years, Entreprise DevOps has experienced a huge transformational shift affecting engineers and SysAdmins. As part of Autonomous IT Talks – a new section on our Youtube channel - we discussed these changes with Savinder Puri, DevOps Evangelist at TBC and author of the book “How do I build a career in DevOps?: A practical handbook to help you start or scale up your career in DevOps”, which is available on Amazon worldwide.\r\n\r\n<!-- \/wp:paragraph --> <!-- wp:paragraph -->\r\n\r\nWe asked Savinder about his view on IT transformation, talked about a career in DevOps and learned how to stay relevant and move fast while you work in a large company and what alternative IT roles you can choose to stay relevant.\r\n\r\n<!-- \/wp:paragraph --> <!-- wp:paragraph -->\r\n\r\nIn this article, we have compiled highlights of this fascinating and useful conversation where Savinder shared his thoughts…\r\n\r\n<!-- \/wp:paragraph -->"},"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v20.3 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How DevOps and Other IT Pros Survive Transformational Shift - Acure AIOps Platform<\/title>\n<meta name=\"description\" content=\"Entreprise DevOps has experienced a huge transformational shift recently. We discussed these changes with Savinder Puri, DevOps Evangelist at TBC.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/\" \/>\n<meta property=\"og:locale\" content=\"en_GB\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How DevOps and Other IT Pros Survive Transformational Shift - Acure AIOps Platform\" \/>\n<meta property=\"og:description\" content=\"Entreprise DevOps has experienced a huge transformational shift recently. We discussed these changes with Savinder Puri, DevOps Evangelist at TBC.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/\" \/>\n<meta property=\"og:site_name\" content=\"Acure AIOps Platform\" \/>\n<meta property=\"article:published_time\" content=\"2022-10-28T13:42:40+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2023-04-09T14:05:47+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-AIT-cover-2.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1920\" \/>\n\t<meta property=\"og:image:height\" content=\"1080\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Elena Hawk\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Elena Hawk\" \/>\n\t<meta name=\"twitter:label2\" content=\"Estimated reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/\",\"url\":\"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/\",\"name\":\"How DevOps and Other IT Pros Survive Transformational Shift - Acure AIOps Platform\",\"isPartOf\":{\"@id\":\"https:\/\/acure.io\/#website\"},\"datePublished\":\"2022-10-28T13:42:40+00:00\",\"dateModified\":\"2023-04-09T14:05:47+00:00\",\"author\":{\"@id\":\"https:\/\/acure.io\/#\/schema\/person\/43b400e67986290b8c20e271be8c1ac6\"},\"description\":\"Entreprise DevOps has experienced a huge transformational shift recently. We discussed these changes with Savinder Puri, DevOps Evangelist at TBC.\",\"breadcrumb\":{\"@id\":\"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/#breadcrumb\"},\"inLanguage\":\"en-GB\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Главная страница\",\"item\":\"https:\/\/acure.io\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How DevOps and Other IT Pros Survive Transformational Shift\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/acure.io\/#website\",\"url\":\"https:\/\/acure.io\/\",\"name\":\"Acure AIOps Platform\",\"description\":\"\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/acure.io\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-GB\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/acure.io\/#\/schema\/person\/43b400e67986290b8c20e271be8c1ac6\",\"name\":\"Elena Hawk\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-GB\",\"@id\":\"https:\/\/acure.io\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/b57eb78de6afb80a2fce19085efdc040?s=96&d=identicon&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/b57eb78de6afb80a2fce19085efdc040?s=96&d=identicon&r=g\",\"caption\":\"Elena Hawk\"},\"description\":\"Content Manager at Acure\",\"url\":\"https:\/\/acure.io\/blog\/author\/kate\/\"}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How DevOps and Other IT Pros Survive Transformational Shift - Acure AIOps Platform","description":"Entreprise DevOps has experienced a huge transformational shift recently. We discussed these changes with Savinder Puri, DevOps Evangelist at TBC.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/","og_locale":"en_GB","og_type":"article","og_title":"How DevOps and Other IT Pros Survive Transformational Shift - Acure AIOps Platform","og_description":"Entreprise DevOps has experienced a huge transformational shift recently. We discussed these changes with Savinder Puri, DevOps Evangelist at TBC.","og_url":"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/","og_site_name":"Acure AIOps Platform","article_published_time":"2022-10-28T13:42:40+00:00","article_modified_time":"2023-04-09T14:05:47+00:00","og_image":[{"width":1920,"height":1080,"url":"https:\/\/acure.io\/wp-content\/uploads\/2022\/10\/Savinder-Puri-AIT-cover-2.png","type":"image\/png"}],"author":"Elena Hawk","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Elena Hawk","Estimated reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/","url":"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/","name":"How DevOps and Other IT Pros Survive Transformational Shift - Acure AIOps Platform","isPartOf":{"@id":"https:\/\/acure.io\/#website"},"datePublished":"2022-10-28T13:42:40+00:00","dateModified":"2023-04-09T14:05:47+00:00","author":{"@id":"https:\/\/acure.io\/#\/schema\/person\/43b400e67986290b8c20e271be8c1ac6"},"description":"Entreprise DevOps has experienced a huge transformational shift recently. We discussed these changes with Savinder Puri, DevOps Evangelist at TBC.","breadcrumb":{"@id":"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/#breadcrumb"},"inLanguage":"en-GB","potentialAction":[{"@type":"ReadAction","target":["https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/acure.io\/blog\/autonomous-it-talks-savinder-puri\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Главная страница","item":"https:\/\/acure.io\/"},{"@type":"ListItem","position":2,"name":"How DevOps and Other IT Pros Survive Transformational Shift"}]},{"@type":"WebSite","@id":"https:\/\/acure.io\/#website","url":"https:\/\/acure.io\/","name":"Acure AIOps Platform","description":"","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/acure.io\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-GB"},{"@type":"Person","@id":"https:\/\/acure.io\/#\/schema\/person\/43b400e67986290b8c20e271be8c1ac6","name":"Elena Hawk","image":{"@type":"ImageObject","inLanguage":"en-GB","@id":"https:\/\/acure.io\/#\/schema\/person\/image\/","url":"https:\/\/secure.gravatar.com\/avatar\/b57eb78de6afb80a2fce19085efdc040?s=96&d=identicon&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/b57eb78de6afb80a2fce19085efdc040?s=96&d=identicon&r=g","caption":"Elena Hawk"},"description":"Content Manager at Acure","url":"https:\/\/acure.io\/blog\/author\/kate\/"}]}},"_links":{"self":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts\/4424"}],"collection":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/users\/219657405"}],"replies":[{"embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/comments?post=4424"}],"version-history":[{"count":52,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts\/4424\/revisions"}],"predecessor-version":[{"id":6058,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/posts\/4424\/revisions\/6058"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/media\/4495"}],"wp:attachment":[{"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/media?parent=4424"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/categories?post=4424"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/acure.io\/wp-json\/wp\/v2\/tags?post=4424"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}